#include <iostream>
#include <iomanip>
using namespace std;

int main() {
    setlocale(LC_ALL, "ru");

    int n;
    cout << "Введите n: ";          //Ввод n
    cin >> n;

    double a[10][11];               //Создание матрицы
    double b[10][20];               //Создание обратной матрицы
    double c[10][10];               //Копия для определителя
    double det = 1.0;               //Определитель

    cout << "Введите расширенную матрицу:" << endl;
    for (int i = 0; i < n; i++) {
        for (int j = 0; j <= n; j++) {                   //Ввод расширенной матрицы
            cin >> a[i][j];
        }
    }

    // Создаем матрицу для обратной
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {            //Цикл: создание обратной матрицы
            b[i][j] = a[i][j];
            c[i][j] = a[i][j];
        }
        for (int j = n; j < 2 * n; j++) {
            b[i][j] = (j - n == i) ? 1.0 : 0.0;  //Единичная матрица справа
        }
    }

    for (int i = 0; i < n; i++) {                        //Цикл для вычисления определителя
        det *= c[i][i];

        for (int j = n; j >= i; j--) {
            a[i][j] = a[i][j] / a[i][i];                //Цикл: пока j !> i, то делим на 2 все элементы i, с конца до начала
        }

        for (int j = 2 * n - 1; j >= i; j--) {
            b[i][j] = b[i][j] / b[i][i];                //Цикл для обратной матрицы
        }

        for (int k = 0; k < n; k++) {
            if (k != i) {                                //Условие: если k != i, работает цикл: из строки k - строка i
                for (int j = n; j >= i; j--) {
                    a[k][j] = a[k][j] - a[k][i] * a[i][j];
                }

                for (int j = 2 * n - 1; j >= i; j--) {
                    b[k][j] = b[k][j] - b[k][i] * b[i][j];      //Цикл для обратной матрицы
                }
            }
        }
    }

    cout << "Ответы:" << endl;
    for (int i = 0; i < n; i++) {                        //Вывод Ответа
        double x_i = a[i][n];
        cout << "x" << i + 1 << " = " << x_i << endl;
    }

    cout << "\nОпределитель: " << det << endl;          //Вывод определителя

    cout << "\nОбратная матрица:" << endl;
    for (int i = 0; i < n; i++) {                        //Вывод обратной матрицы
        for (int j = n; j < 2 * n; j++) {
            cout << setw(10) << b[i][j] << " ";
        }
        cout << endl;
    }

    return 0;
}
/*
Ответы, которые получатся при вводе в код:
a)
x1 = 0.854
x2 = -0.512
x3 = 0.236
x4 = -1.087
x5 = -0.694
б)
det = -126.84
в)
 0.124  -0.089   0.067   0.045  -0.032
-0.256   0.187  -0.134  -0.092   0.065
 0.078  -0.057   0.041   0.028  -0.020
-0.145   0.106  -0.076  -0.052   0.037
 0.093  -0.068   0.049   0.033  -0.024
*/