#include <iostream>
#include <cmath>
using namespace std;

int main() {
    setlocale(LC_ALL, "ru");

    int n;
    double eps;
    cout << "Введите n: ";          //Ввод n
    cin >> n;
    cout << "Введите ε: ";          //Ввод точности
    cin >> eps;

    double a[10][11];               //Расширенная матрица
    double x[10], y[10];            //Текущее и новое решение

    cout << "Введите расширенную матрицу:" << endl;
    for (int i = 0; i < n; i++) {
        for (int j = 0; j <= n; j++) { //Ввод матрицы
            cin >> a[i][j];
        }
    }

    double d = 0;                   //Для проверки сходимости

    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            if (j != i) {                        //Условие: если j != i
                a[i][j] = -a[i][j] / a[i][i];  //Делим на диагональный
                d = d + a[i][j] * a[i][j];     //Сумма квадратов
            }
        }
        a[i][n] = a[i][n] / a[i][i];           //Делим свободный член
        a[i][i] = 0;                           //Обнуляем диагональ
    }

    d = sqrt(d);                    //Корень из суммы квадратов

    if (d >= 1) {
        cout << "Ошибка:" << endl;    //Условие для проверки сходимости
        return 0;
    }

    d = 2 * eps;                    //Начальная разница

    while (d > eps) {                //Цикл: пока разница больше точности - сбрасываем разницу
        d = 0;

        for (int i = 0; i < n; i++) {
            y[i] = a[i][n];                     //Начинаем со свободного члена
            for (int j = 0; j < n; j++) {
                y[i] = y[i] + a[i][j] * x[j];  //Добавляем a_ij * x_j
            }
            d = d + (y[i] - x[i]) * (y[i] - x[i]); //Сумма квадратов разниц
        }

        for (int i = 0; i < n; i++) {
            x[i] = y[i];            //Обновляем текущее решение
        }
    }

    cout << "Решение:" << endl;
    for (int i = 0; i < n; i++) {    //Вывод ответа
        cout << "x" << i + 1 << " = " << x[i] << endl;
    }
    return 0;
}
/*
Ответы при вводе в программу:
а)
x1 = 0.1002
x2 = 0.3501
x3 = 0.2003
б)
x1 = -0.1504
x2 = -0.2501
x3 = 0.0502
x4 = 0.0803
в)
x1 = 0.4503
x2 = -0.1002
x3 = 0.3001
x4 = 0.1504
x5 = -0.2003
*/